""" 이해하기 쉽도록 모든 변수 및 함수는 중복 선언합니다. """


# 스트라이드를 이용해 홀수, 짝수 리스트를 분리
def fn_1():
    x = ['빨강', '주황', '노랑', '녹색', '파랑', '자주']
    odds = x[::2]
    evens = x[1::2]
    print(odds)
    print(evens)
    pass


# 여러개의 슬라이싱 구문에 스트라이딩이 포함되어 혼란스럽다.
def fn_2():
    x = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']
    print(x[::2])  # ['a', 'c', 'e', 'g']
    print(x[::-2])  # ['h', 'f', 'd', 'b']

    print(x[2::2])  # ['c', 'e', 'g']
    print(x[-2::-2])  # ['g', 'e', 'c', 'a']
    print(x[-2:2:-2])  # ['g', 'e']
    print(x[2:2:-2])  # []
    print(x[2:2])  # []
    pass


# 시작이나 끝 인덱스를 함께 증가값을 사용해야 한다면, 스트라이딩한 결과를 변수에 대입한 후 슬라이싱한다.
def fn_3():
    x = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']

    # 알아보기 힘들다.
    result = x[2:5:2]  # ['c', 'e']
    print(result)

    # 여러개의 코드로 분리하지만, 내부적인 로직을 이해하기 쉽다.
    y = x[::2]  # ['a', 'c', 'e', 'g']
    z = y[1:-1]  # ['c', 'e']
    print(y)
    print(z)
    pass


if __name__ == '__main__':
    # fn_1()
    # fn_2()
    # fn_3()
    pass
